{"meta":{"title":"Mikkeller Script","subtitle":"행복을 찾아서-","description":"자바스크립트 끝이 어딘지 보자구","author":"Myeongwook Kim","url":"http://mikkeller.github.io"},"pages":[],"posts":[{"title":"패턴분석","slug":"CustomJob","date":"2018-04-04T04:00:00.000Z","updated":"2018-04-05T01:07:37.485Z","comments":true,"path":"2018/04/04/CustomJob/","link":"","permalink":"http://mikkeller.github.io/2018/04/04/CustomJob/","excerpt":"","text":"패턴분석공고 노출양 절대적으로 양도 부족하고, 이중에서도 근무할 수 있는 시간대나 이런 것도 맞지 않고, 중복되는 같은 아르바이트인데 지역만 다르게 되어있는 것들이 있어서 조금 어려운 부분이 있었다. 알바몬이 공고양이 더 많다, 그래서 돈이 급하다 싶으면 알바몬을 본다. 전체적인 공고양은 많이 나왔다고 생각되지만 이미 지난게 나와있고 구할 수 있는 건 거의 없어서 아쉬웠다. 맞춤알바 패턴 지역과 성별을 선택한다. 다른 조건들은 아예 설정 하지 않는다.지역은 일단 거리가 멀면 당연히 일을 할 수가 없으니 설정하는 거고, 성별은 은근히 여성들만 구하는 알바가 많아서 선택한다.성별을 선택하면 여자만 구하는 알바는 절대 안나오게 되니까, 그래서 설정하면 정확도가 높아지기 때문에 이 부분에 대해서는 편했다.지역과 성별이 가장 노출되는 공고가 정확하다고 생각이 됐다고 한다. 품질보다는 양을 보려고 서울 전체로 설정을 한다. 다 선택하는게 귀찮아서 맞춤알바는 거의 안쓴다. 일단 가능한 모든 옵션을 크게 입력을 해 놓는 편이라서 맞춤알바는 자신한테 조금 불편한 것 같다. 맞춤알바는 내 자신이 원하는 것을 좀 간추려서 보여주겠다는게 목적인데, 개인적으로는 이런거는 선호하는 편이 아니라서 차라리 정보가 많은 상태에서 자신이 고르는 게 더 좋다고 한다.(디테일보다는 양이 많은 것이 좋다고 생각하는 듯) 추천서비스에 대한 생각 &lt;공통&gt; 단기알바, 맞춤알바 이런 탭들이 많아서 좋을 수도 있겠지만 이걸 하나하나 단기알바 따로 보고, 교육강사 검색해서 따로 보고 이랬을 때 한 번 봤던 겹치는 공고들은 안나오게해서 중복되는 걸 줄여준다던가 그런 부분이 필요한 것 같다.검색해서 봤던 공고를 단기알바로 봤을 때 내가 봤던 공고가 또 상위에서 보여지면 그만큼 시간낭비가 있기 때문에 내가 스크랩 해놓은 것도 목록에 같이 보인다. 그런것들은 차라리 사라진 채 다른 공고들만 보여지거나 이렇게 해서 페이지 수도 줄고 같은시간에 더 많은 공고들을 볼 수 있고 그런 기능이 좋지 않을까? &lt;알바ForU&gt; 알바ForU -&gt; 맞춤알바 -&gt; 전체 검색 으로 이용을 한다.알바ForU(알바몬의 스마트알바)를 먼저 사용하는 이유는 올라오는 수는 적지만 지원한 거 바탕으로 최대한 비슷한 공고를 보여주니까 거기서 한 두개정도 보고 지원을 한다음에 맞춤알바로 넘어가고 맞춤알바에서 너무 없으면 전체 검색으로 간다. &lt;스크랩&gt;스크랩 기능은 언제 사용하냐면 통화가 어려울 때는 스크랩을 하고 다음 날 통화를 한다. 스크랩은 2~3개 정도 하는 것 같다.스크랩한 것들은 지원을 하는 건가요? 장소를 잊어버릴 때 쯤에 스크랩을 본다. 면접기회를 받은 경우 스크랩을 한다. 스크랩 기능 편리한 것 같다. 기대하는 기능 중복 공고 미노출 초등학생 방학 계획표처럼 원 모양의 그래프를 그리고 내가 알바를 하면 무슨 일을 하게 되는가를 한 눈에 보고싶다.보통 음식점을 가면 뻔하겠지만 서빙 하겠지, 설거지 할 수도 있고, 음식점에 할 일이 많은데 알바생에게 무슨 포지션을 맡길지느 정확하게 안 알려주는 것 같아요. 실제로 공고가 올라와있는데 마감되있는 경우가 엄청 많다. 알바가 구해졌으면 무조건 마감을 할 수 있게 그런 시스템이 있었으면 좋겠다. 몇년동안 마감된 알바공고를 보고 전화를 100번도 넘게 한 것 같다. 어느정도냐면 한 지역에 공고 100개가 올라오면 그 중에 30개는 마감된 것이다. 그리고 시간대가 다른 경우도 많아서 10개 중에 7개는 틀리다. 이러한 이유때문에 쉽고 빠르게 찾으려고 이용하는 서비스에서 1시간~2시간이 걸리게 된다. 스크랩 해놓은 것끼리 누르면 비교를 하는 기능이 있으면 괜찮을 것 같다. 근데 알바는 사람따라 다르기 때문에 그 비교하는 객관적인 수치가 없으면 어려울 것 같다.","categories":[],"tags":[]},{"title":"값, 식, 문(표현과 연산자)","slug":"first-p","date":"2018-04-01T04:00:00.000Z","updated":"2018-04-05T01:22:49.284Z","comments":true,"path":"2018/04/01/first-p/","link":"","permalink":"http://mikkeller.github.io/2018/04/01/first-p/","excerpt":"","text":"연산자Why Front-End Developer?","categories":[],"tags":[]}]}